few more improvements
